docs/cmake_build_guide.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Cmake Build Guide For GridDB Python Client</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Cmake Build Guide For GridDB Python Client"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2019-08-26T10:58+0900"/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<STYLE type="text/css">
<!-
.break { page-break-before: always; }
-->
</STYLE>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Cmake Build Guide For GridDB Python Client</h1>




<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Building the GridDB python client</a>
<ul>
<li><a href="#sec-1-1">1.1 Confirming the environment</a></li>
<li><a href="#sec-1-2">1.2 Required software to build GridDB python client</a></li>
<li><a href="#sec-1-3">1.3 Installing required software</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1 Install cmake</a></li>
<li><a href="#sec-1-3-2">1.3.2 Install python</a></li>
<li><a href="#sec-1-3-3">1.3.3 Install swig</a></li>
<li><a href="#sec-1-3-4">1.3.4 Install GridDB C client</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4 Building GridDB python client</a>
<ul>
<li><a href="#sec-1-4-1">1.4.1 Generate standard build files from cmake</a></li>
<li><a href="#sec-1-4-2">1.4.2 Build python client</a></li>
</ul>
</li>
<li><a href="#sec-1-5">1.5 Run sample to check for building Python client</a></li>
</ul>
</li>
</ul>
</div>
</div>




<DIV class="break"></DIV><BR>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Building the GridDB python client</h2>
<div class="outline-text-2" id="text-1">


<p>
This section shows how to build the GridDB python client on a single machine.
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Confirming the environment</h3>
<div class="outline-text-3" id="text-1-1">


<p>
Confirm that OS is Windows 10 64 bit
</p>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Required software to build GridDB python client</h3>
<div class="outline-text-3" id="text-1-2">

<ul>
<li>cmake: version 3.14.5
</li>
<li>python: version 3.6.4
</li>
<li>swig: version 3.0.12
</li>
<li>GridDB C client: version 4.2.0
</li>
</ul>

<p>In order to build, we also need to install Visual Studio 2017
</p>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Installing required software</h3>
<div class="outline-text-3" id="text-1-3">


</div>

<div id="outline-container-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> Install cmake</h4>
<div class="outline-text-4" id="text-1-3-1">

<ul>
<li>Download zip package from <a href="https://github.com/Kitware/CMake/releases/download/v3.14.5/cmake-3.14.5-win64-x64.zip">https://github.com/Kitware/CMake/releases/download/v3.14.5/cmake-3.14.5-win64-x64.zip</a>
</li>
<li>Extract the zip package and get resource of cmake tool
</li>
</ul>

</div>

</div>

<div id="outline-container-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> Install python</h4>
<div class="outline-text-4" id="text-1-3-2">

<ul>
<li>Download and install python 3.6.4 from <a href="https://www.python.org/ftp/python/3.6.4/python-3.6.4-amd64.exe">https://www.python.org/ftp/python/3.6.4/python-3.6.4-amd64.exe</a>
</li>
<li>Set path for PYTHON_RESOURCE in <b>CmakeList.txt</b>
</li>
</ul>




<pre class="example">set(PYTHON_RESOURCE C:/Users/username/AppData/Local/Programs/Python/Python36)
</pre>

</div>

</div>

<div id="outline-container-1-3-3" class="outline-4">
<h4 id="sec-1-3-3"><span class="section-number-4">1.3.3</span> Install swig</h4>
<div class="outline-text-4" id="text-1-3-3">

<ul>
<li>Download zip package from <a href="https://sourceforge.net/projects/swig/files/swigwin/swigwin-3.0.12/swigwin-3.0.12.zip/download">https://sourceforge.net/projects/swig/files/swigwin/swigwin-3.0.12/swigwin-3.0.12.zip/download</a>
</li>
<li>Extract the zip package then set path for SWIG_RESOURCE in <b>CmakeList.txt</b>
</li>
</ul>




<pre class="example">set(SWIG_RESOURCE E:/swigwin-3.0.12)
</pre>

</div>

</div>

<div id="outline-container-1-3-4" class="outline-4">
<h4 id="sec-1-3-4"><span class="section-number-4">1.3.4</span> Install GridDB C client</h4>
<div class="outline-text-4" id="text-1-3-4">

<ul>
<li>Please refer to <a href="https://github.com/griddb/c_client">https://github.com/griddb/c\_client</a> to install GridDB C client.
</li>
<li>After installing GridDB C client, set path for C_LIB (path for gridstore_c.lib) and C_HEADER (path for gridstore.h) in <b>CmakeList.txt</b>
</li>
</ul>




<pre class="example">set(C_LIB E:/c_client-master/bin/x64/Release)
set(C_HEADER E:/c_client-master/client/c/include)
</pre>

</div>
</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Building GridDB python client</h3>
<div class="outline-text-3" id="text-1-4">

<p>Before building Griddb python client, please set link for SOURCE_HEADER (link to folder store cpp headers) in <b>CmakeList.txt</b>
</p>


<pre class="example">set(SOURCE_HEADER E:/SourceCode/src)
</pre>


</div>

<div id="outline-container-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> Generate standard build files from cmake</h4>
<div class="outline-text-4" id="text-1-4-1">

<ul>
<li>Open &lt;PATH_TO_CMAKE&gt;/cmake-3.14.5-win64-x64/bin/cmake-gui.exe
</li>
<li>Set link for <b>source code</b> in cmake gui: link to folder store <b>CmakeList.txt</b>
</li>
<li>Set link for <b>the binaries</b> in cmake gui: link to folder which generated files are store (sln file, py file)
</li>
<li>Run <b>Configure</b> with set <b>Specify the generator for this project</b>  is <b>Visual Studio 15 2017</b>, and for <b>Optional toolset to use</b> is <b>x64</b>
</li>
<li>Run <b>Generate</b> to get standard build files
</li>
</ul>

</div>

</div>

<div id="outline-container-1-4-2" class="outline-4">
<h4 id="sec-1-4-2"><span class="section-number-4">1.4.2</span> Build python client</h4>
<div class="outline-text-4" id="text-1-4-2">

<ul>
<li>Open &lt;PATH_TO_OUTPUT_CMAKE&gt;/griddb_python.sln by Visual Studio 2017
</li>
<li>Build <b>griddb_python</b> project to get <b>_griddb_python.pyd</b> library and <b>griddb_python.py</b> interface
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Run sample to check for building Python client</h3>
<div class="outline-text-3" id="text-1-5">

<ul>
<li>Put <b>_griddb_python.pyd</b>, <b>gridstore_c.dll</b> libraries and <b>griddb_python.py</b> interface into folder store <b>sample1.py</b>
</li>
</ul>




<pre class="example">&lt;PATH_TO&gt;/python.exe sample1.py 239.0.0.1 &lt;port&gt; &lt;cluster&gt; &lt;username&gt; &lt;password&gt;
</pre>


</div>
</div>
</div>
</div>

<div id="postamble">


</div>
</body>
</html>
